Catalogs/СпискиЭлементов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>СпискиЭлементов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Элемент</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/СписокЭлементов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Тип = ?(Параметры.Свойство("Тип"), Параметры.Тип, "");
	Если Тип = "" Тогда Отказ = Истина; Возврат; КонецЕсли; 
	
	Заголовок = ?(Параметры.Свойство("Заголовок"), Параметры.Заголовок, "Список элементов справочника");
	
	локСписок = ?(Параметры.Свойство("Список"), Параметры.Список, Новый СписокЗначений);
	
	СписокДокументов = ?(Параметры.Свойство("СписокДокументов"), Параметры.СписокДокументов, Ложь);
	
	локИсключить = ?(Параметры.Свойство("Исключить"), Параметры.Исключить, "не надо");
	
	Если локИсключить = "не надо" Тогда 
		Исключить = Ложь;
		Элементы.Исключить.Видимость = Ложь;
	Иначе 
		Исключить = локИсключить;
	КонецЕсли; 
	
	//это нужно сохранить для добавления в справочник, чтобы группы отличались от списка товаров
	ТипДляСправочника = Тип;
	
	ТолькоГруппы = Ложь;
	Если Тип = "ГруппыНоменклатуры" Тогда  
		ТолькоГруппы = Истина;
		Тип = "Номенклатура";
	КонецЕсли; 
	
	Если СписокДокументов Тогда 
		Список.ТипЗначения = Новый ОписаниеТипов("ДокументСсылка." + Тип);	
	Иначе 
		Список.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка." + Тип);	
	КонецЕсли; 
	
	Если ТолькоГруппы Тогда  
		Элементы.СписокЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	КонецЕсли; 
	
	Список.ЗагрузитьЗначения(локСписок.ВыгрузитьЗначения());
	
	ЭтаФорма.Заголовок = Заголовок;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Пар = Новый СписокЗначений;
	Пар.ЗагрузитьЗначения(Список.ВыгрузитьЗначения());
	
	гоСвернутьСписокЗначений(Пар, "Возр");
	
	Рез = Новый Структура("Список, Исключить", Пар, Исключить);
	
	ОповеститьОВыборе(Рез);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор()
	гоСтандартныйОтбор(Списки, 0, Истина, ТипДляСправочника);
	гоСтандартныйОтбор(Списки, 1, ТолькоСвои, гоПользователь());
КонецПроцедуры

&НаКлиенте
Процедура ТолькоСвоиПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура СпискиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Загрузить(0);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьИмя(Имя, локТип)
	Нов = Справочники.СпискиЭлементов.СоздатьЭлемент();
	Нов.Наименование = Имя;
	Нов.Автор = гоПользователь();
	Нов.Тип = локТип;
	Нов.Записать();
	
	Возврат Нов.Ссылка;
КонецФункции 

&НаКлиенте
Процедура СпискиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	
	Имя = "";
	Тек = Элементы.Списки.ТекущаяСтрока;
	Если НЕ Тек = Неопределено Тогда Имя = гоРеквизит(Тек, "Наименование") КонецЕсли;
	
	Если НЕ ВвестиСтроку(Имя, "Новый список элементов (введите название)", 30) Тогда Возврат КонецЕсли; 
	Если Имя = "" Тогда Возврат КонецЕсли; 
	
	Элементы.Списки.ТекущаяСтрока = ДобавитьИмя(Имя, ТипДляСправочника);
	
	Элементы.Списки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СпискиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьИмя(Тек)
    Спр = Тек.ПолучитьОбъект();
	Спр.Удалить();
КонецПроцедуры 

&НаКлиенте
Процедура СпискиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	
	Тек = Элементы.Списки.ТекущаяСтрока;
	Если Тек = Неопределено Тогда Возврат КонецЕсли; 
	
	Авт = гоРеквизит(Тек, "Автор");
	Если НЕ Авт = гоПользователь() Тогда клОшибка("Чужой список!" + гоРС() + "Удаление запрещено!"); Возврат; КонецЕсли; 
	
	Если клНетДа("Удалить список " + гоИмя(Тек) + "?") Тогда Возврат КонецЕсли; 
	
	УдалитьИмя(Тек);
	
	Элементы.Списки.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИмя(Тек)
	Список.ЗагрузитьЗначения(Тек.Список.ВыгрузитьКолонку("Элемент"));
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Тек = Элементы.Списки.ТекущаяСтрока;
	Если Тек = Неопределено Тогда Возврат КонецЕсли; 
	
	Если клНетДа("Загрузить элементы списка из " + гоИмя(Тек) + "?") Тогда Возврат КонецЕсли; 
	
	ЗагрузитьИмя(Тек);
КонецПроцедуры

&НаСервере
Процедура СохранитьИмя(Тек)
    Спр = Тек.ПолучитьОбъект();
	
	Спр.Список.Очистить();
	
	Для Каждого Стр Из Список Цикл
		Нов = Спр.Список.Добавить();
		Нов.Элемент = Стр.Значение;
	КонецЦикла; 
	
	Спр.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Тек = Элементы.Списки.ТекущаяСтрока;
	Если Тек = Неопределено Тогда Возврат КонецЕсли; 
	
	Авт = гоРеквизит(Тек, "Автор");
	Если НЕ Авт = гоПользователь() Тогда клОшибка("Чужой список!" + гоРС() + "Изменение запрещено!"); Возврат; КонецЕсли; 
	
	гоСвернутьСписокЗначений(Список, "Возр");
	
	Если клНетДа("Сохранить элементы списка в " + гоИмя(Тек) + "?") Тогда Возврат КонецЕсли; 
	
	СохранитьИмя(Тек);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Если клНетДа("Удалить из списка?") Тогда Отказ = Истина; Возврат; КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Если клНетДа("Очистить список?") Тогда Возврат КонецЕсли;
	
	Список.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОК(0);
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
КонецПроцедуры
